#
# @autor BetaFish <yale2a1@gmail.com>
# @since 2016-06-04
#
'''
# TODO: 파이썬 코드로 작성하기
옛날에 어느 나라에 승려들만 모여 사는 섬이 있다.

그들 중에서 어느 사람은 눈이 빨갛고 어느 사람은 눈이 갈색이다.

눈이 빨간 사람은 마법에 걸려 있기 때문에 스스로 눈이 빨갛다는 사실을 깨닫게 되면

그날 밤 12시에 스스로 목숨을 끊어야만 한다.

승려들은 서로의 눈 색깔에 대해 전혀 언급하지 않는다는 불문율이 있었기에 상대방의 눈 색깔을 알려줄 수도 없었다.

그 섬에는 거울도 없고, 거울 비슷한 물건도 없었기 때문에 자신의 눈이 무슨 색인지 아는 사람은아무도 없었다.

그래서 그들은 자신의 눈 색깔을 알 길이 없었기에 행복하게 살수 있었으며,자살 따위를 하는 사람은 아무도 없었다.

그러던 어느 날 그 섬에 관광객이 찾아 왔다.

그는 승려들 사이에 존재하는 규칙을 알지 못했기 때문에 절대로 하지 말아야 할 말을 내뱉고 말았다.

"당신들 중에서 적어도 한 명은 눈이 빨간색이로군요."

무심한 관광객은 그 날로 되돌아갔지만, 남아 있는 승려들은 생전 처음으로 눈 색깔에 대한 말이 나왔기 때문에 크게 동요하지 않을 수 없었다.

그후 그 섬의 12시에, 어떤일이 일어나게 되는가?
'''
